app/views/entries/_footer.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."entry_id" = ?  [["entry_id", 10]]
---
<%= entry.posted_at.strftime("%Y/%m/%s %H:%M") %>
<% if (count = entry.votes.count) > 0 %>