app/controllers/admin/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (released_at <= '2016-12-07 09:53:07.056960' AND ('2016-12-07 09:53:07.056960' < expired_at OR expired_at IS NULL)) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.readable_for(current_member).order(released_at: :desc)
        .paginate(page: params[:page], per_page: 5)