app/controllers/accounts_controller.rb

  def update
      @member = current_member
      @member.assign_attributes(account_params)
      if @member.save
---
UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "Hanaaaaa"], ["updated_at", 2016-11-16 04:50:29 UTC], ["id", 3]]