app/controllers/articles_controller.rb

    def index
        @articles = Article.open.readable_for(current_member).order(released_at: :desc)
        .paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE (released_at <= '2016-11-01 09:48:16.804529' AND ('2016-11-01 09:48:16.804529' < expired_at OR expired_at IS NULL)) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT COUNT(*) FROM "articles"

    def show
        @article = Article.open.readable_for(current_member).find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]