app/controllers/entries_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND (status <> 'draft' OR member_id = 1) ORDER BY "entries"."posted_at" DESC LIMIT ? OFFSET ?  [["member_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."member_id" = ? AND (status <> 'draft' OR member_id = 1)  [["member_id", 1]]
---
  def index
      if params[:member_id] #ネストされたリソースを扱うかどうか
          @member = Member.find(params[:member_id])
          @entries = @member.entries
      else
          @entries = Entry.all
      end
      @entries = @entries.readable_for(current_member)
      .order(posted_at: :desc).paginate(page: params[:page], per_page: 5)

SELECT  "entries".* FROM "entries" WHERE (status <> 'draft' OR member_id = 1) AND "entries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
      @entry = Entry.readable_for(current_member).find(params[:id])

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 1], ["id", 10], ["LIMIT", 1]]
---
  def edit
      @entry = current_member.entries.find(params[:id])

INSERT INTO "entries" ("member_id", "title", "body", "posted_at", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
      @entry = Entry.new(entry_params)
      @entry.author = current_member
      if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 1], ["id", 10], ["LIMIT", 1]]
UPDATE "entries" SET "body" = ?, "status" = ?, "posted_at" = ?, "updated_at" = ? WHERE "entries"."id" = ?
---
  def update
      @entry = current_member.entries.find(params[:id])
      @entry.assign_attributes(entry_params)
      if @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."member_id" = ? AND "entries"."id" = ? LIMIT ?  [["member_id", 1], ["id", 31], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 31]]
---
  def destroy
      @entry = current_member.entries.find(params[:id])
      @entry.destroy

SELECT  "entries".* FROM "entries" WHERE (status <> 'draft') AND "entries"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
INSERT INTO "votes" ("entry_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["entry_id", 29], ["member_id", 1], ["created_at", 2016-12-05 09:56:14 UTC], ["updated_at", 2016-12-05 09:56:14 UTC]]
---
  def like
      @entry = Entry.published.find(params[:id])
      current_member.voted_entries << @entry