app/controllers/members_controller.rb

    def index
        @members = Member.order("number")
        .paginate(page: params[:page], per_page: 15)
---
SELECT  "members".* FROM "members" ORDER BY number LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "members"

    def show
        @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]