app/controllers/top_controller.rb

SELECT  "articles".* FROM "articles" WHERE (released_at <= '2016-10-25 12:23:42.628279' AND ('2016-10-25 12:23:42.628279' < expired_at OR expired_at IS NULL)) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    #   @message = "おはようございます"
        @articles = Article.open.readable_for(current_member).order(released_at: :desc).limit(5)